InformationRegisters/ЛБ_СостоянияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СостоянияСотрудников</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СостоянияСотрудника</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидВремени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ВидыИспользованияРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеПредположительно</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ЛБ_ВидыИспользованияРабочегоВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_ВидыИспользованияРабочегоВремени</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БуквенныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦифровойКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БуквенныйКодБюджетный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БуквенныйКодБюджетный2009</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееВремя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеВремя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ВидыИспользованияРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Целосменное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПричинаБлокировки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеСотрудника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СостоянияСотрудника</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ЛБ_СостоянияСотрудников/Ext/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	//Для каждого Запись Из ЭтотОбъект Цикл
	//	
	//	Состояние = Запись.Состояние;
	//	Если ЗначениеЗаполнено(Состояние) Тогда
	//		ВидРабВремени = ВернутьВидРабочегоВремени(Состояние);
	//		Если ВидРабВремени <> Неопределено Тогда
	//			
	//			НаборЗаписей = РегистрыСведений.ЛБ_ВременнаяБлокировкаСотрудника.СоздатьНаборЗаписей();		
	//			НаборЗаписей.Отбор.Сотрудник.Установить(Запись.Сотрудник);
	//			НаборЗаписей.Отбор.ДатаНачала.Установить(НачалоДня(Запись.Период));
	//			НаборЗаписей.Отбор.ДатаОкончания.Установить(КонецДня(Запись.ДействуетДо));
	//			НаборЗаписей.Отбор.ПричинаБлокировки.Установить(ВидРабВремени);
	//			
	//			НоваяЗапись 			      = НаборЗаписей.Добавить(); 
	//			НоваяЗапись.Сотрудник         = Запись.Сотрудник; 
	//			НоваяЗапись.ДатаНачала 	      = НачалоДня(Запись.Период);
	//			НоваяЗапись.ДатаОкончания 	  = КонецДня(Запись.ДействуетДо); 
	//			НоваяЗапись.ПричинаБлокировки = ВидРабВремени;  
	//			
	//			НаборЗаписей.Записать(); 			
	//			
	//		КонецЕсли;
	//	КонецЕсли;		
	//КонецЦикла;   
КонецПроцедуры


Функция ВернутьВидРабочегоВремени(Состояние)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ВидыИспользованияРабочегоВремени.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЛБ_ВидыИспользованияРабочегоВремени КАК ЛБ_ВидыИспользованияРабочегоВремени
	               |ГДЕ
	               |	ЛБ_ВидыИспользованияРабочегоВремени.СостояниеСотрудника = &СостояниеСотрудника
	               |	И ЛБ_ВидыИспользованияРабочегоВремени.ЭтоПричинаБлокировки = Истина";
	Запрос.УстановитьПараметр("СостояниеСотрудника", Состояние);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
